SimulationDatabase/CurvedDuct/Template/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//libs ( "libmy_GCEARSM_br_btheta_features.so" );
//libs ( "libFrozenTurbModels.so" );

application     simpleFoamFeatures;//

//startFrom       latestTime;

startTime 0; 
endTime   5000; // the 0.org folder is the RANS solution

deltaT   1;

writeControl    timeStep;

writeInterval   1;

purgeWrite      1;

writeFormat     ascii;

writePrecision  15;

writeCompression uncompressed;

timeFormat      general;

timePrecision   15;

runTimeModifiable yes;//true;


functions
{
    #includeFunc "stressComponents"
    #includeFunc "pressureCoefficient"
    #includeFunc "sample"
    #includeFunc "sampleCp"
    #includeFunc "writeCellCentres"
    #includeFunc "wallShearStress"
}


libs ("libmyIncompressibleTurbulenceModels.so");


