SimulationDatabase/CurvedDuct/Template/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "5000";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1 0 0);

boundaryField
{
    bottomWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    topWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            fixedValue;
        value           nonuniform List<vector> 
100
(
(0.0888460774336559 1.34333851993156e-16 0)
(0.263416909228283 -7.47567679686483e-16 0)
(0.400877592112822 -1.32320130346558e-15 0)
(0.488035300106042 -5.48956581490949e-15 0)
(0.54612797752665 -4.58642534768548e-15 0)
(0.588891659847205 -3.98976870971693e-15 0)
(0.622615280556598 -3.1520339409475e-15 0)
(0.650495257185463 -2.60334589024655e-15 0)
...
)
;
    }
}


// ************************************************************************* //
