SimulationDatabase/CurvedDuct/Template/0/bijDeltaFrozen
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volSymmTensorField;
    location    "0";
    object      bijDelta;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform (0 0 0 0 0 0);
;

boundaryField
{
    bottomWall
    {
        type            fixedValue;
        value           uniform (0 0 0 0 0 0);
    }
    topWall
    {
        type            fixedValue;
        value           uniform (0 0 0 0 0 0);
    }
    inlet
    {
        type            fixedValue;
        value           uniform (0 0 0 0 0 0);
    }
    outlet
    {
        type            fixedValue;
        value           uniform (0 0 0 0 0 0);
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
