SimulationDatabase/CurvedDuct/Template/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "5000";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    bottomWall
    {
        type            fixedValue;
        value           uniform 1e-15;
    }
    topWall
    {
        type            fixedValue;
        value           uniform 1e-15;
    }
    outlet
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
100
(
0.000259397298278431
0.000609772872373744
0.00280524068047845
0.00441555962369891
0.00518090898396698
0.00557129905095674
0.00578313538184579
0.00589895045605662
...
)
;
    }
}


// ************************************************************************* //
