SimulationDatabase/CurvedDuct/Template/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "5000";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 10;

boundaryField
{
    bottomWall
    {
        type            omegaWallFunction;
        blending        binomial;
        n               2;
        value           uniform 0;
    }
    topWall
    {
        type            omegaWallFunction;
        blending        binomial;
        n               2;
        value           uniform 0;
    }
    outlet
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
100
(
583.965251838681
115.159654259225
51.6027638390594
30.3504034493333
20.3600755648328
14.8602871939585
11.4750703365155
9.21660851048044
...
)
;
    }
}


// ************************************************************************* //
